Seeed-Studio/ArduinoCore-mbed/boards.txt
nicla_sense.build.variant=NICLA
nicla_sense.build.mcu=cortex-m4
nicla_sense.build.extra_flags=
nicla_sense.build.architecture=cortex-m4
nicla_sense.build.fpu=-mfpu=fpv4-sp-d16
nicla_sense.build.float-abi=-mfloat-abi=softfp
nicla_sense.build.board=NICLA
nicla_sense.build.ldscript=linker_script.ld
nicla_sense.compiler.mbed.arch.define=-DARDUINO_ARCH_NRF52832
nicla_sense.compiler.mbed.defines={build.variant.path}/defines.txt
nicla_sense.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
nicla_sense.compiler.mbed.cflags={build.variant.path}/cflags.txt
nicla_sense.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
nicla_sense.compiler.mbed.includes={build.variant.path}/includes.txt
nicla_sense.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
nicla_sense.compiler.mbed="{build.variant.path}/libs/libmbed.a"
nicla_sense.vid.0=0x2341
nicla_sense.pid.0=0x0060
nicla_sense.upload_port.0.vid=0x2341
nicla_sense.upload_port.0.pid=0x0060

nicla_sense.upload.tool=openocd
nicla_sense.upload.tool.default=openocd
nicla_sense.upload.protocol=
nicla_sense.upload.config=-f target/nrf52.cfg
nicla_sense.upload.programmer=-f interface/cmsis-dap.cfg
nicla_sense.upload.transport=-c "transport select swd; adapter speed 1000"
nicla_sense.upload.use_1200bps_touch=false
nicla_sense.upload.wait_for_upload_port=true
nicla_sense.upload.native_usb=true
nicla_sense.upload.maximum_size=527616
nicla_sense.upload.maximum_data_size=64288

nicla_sense.bootloader.tool=openocd
nicla_sense.bootloader.tool.default=openocd
nicla_sense.bootloader.extra_action.preflash=echo INFO:removed_mass-erase
nicla_sense.bootloader.config=-f target/nrf52.cfg
nicla_sense.bootloader.programmer=-f interface/cmsis-dap.cfg
nicla_sense.bootloader.file=NICLA/bootloader.hex


##############################################################

wio_pico.name=WIO_RP2040_MINI_DEV_BOARD
wio_pico.build.core=arduino
wio_pico.build.crossprefix=arm-none-eabi-
wio_pico.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/

wio_pico.build.variant=WIO_RP2040_MINI_DEV_BOARD
wio_pico.build.mcu=cortex-m0plus
wio_pico.build.extra_flags=
wio_pico.build.fpu=
wio_pico.build.float-abi=
wio_pico.build.architecture=cortex-m0plus
wio_pico.build.board=WIO_RP2040_MINI_DEV_BOARD
wio_pico.build.ldscript=linker_script.ld
wio_pico.compiler.mbed.arch.define=-DARDUINO_ARCH_RP2040
wio_pico.compiler.mbed.defines={build.variant.path}/defines.txt
wio_pico.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
wio_pico.compiler.mbed.cflags={build.variant.path}/cflags.txt
wio_pico.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
wio_pico.compiler.mbed.includes={build.variant.path}/includes.txt
wio_pico.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
wio_pico.compiler.mbed="{build.variant.path}/libs/libmbed.a"
wio_pico.vid.0=0x2886
wio_pico.pid.0=0x8043
wio_pico.upload_port.0.vid=0x2886
wio_pico.upload_port.0.pid=0x8043
wio_pico.upload.tool=picotool
wio_pico.upload.tool.default=picotool
wio_pico.upload.protocol=
wio_pico.upload.transport=
wio_pico.upload.use_1200bps_touch=true
wio_pico.upload.wait_for_upload_port=false
wio_pico.upload.native_usb=true
wio_pico.upload.maximum_size=16777216
wio_pico.upload.maximum_data_size=270336
wio_pico.bootloader.tool=openocd
wio_pico.bootloader.tool.default=openocd
wio_pico.bootloader.config=-f target/rp2040.cfg
wio_pico.bootloader.programmer=-f interface/cmsis-dap.cfg

##############################################################


##############################################################

xiao_pico.name=SEEED_XIAO_RP2040
xiao_pico.build.core=arduino
xiao_pico.build.crossprefix=arm-none-eabi-
xiao_pico.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/

xiao_pico.build.variant=SEEED_XIAO_RP2040
xiao_pico.build.mcu=cortex-m0plus
xiao_pico.build.extra_flags=
xiao_pico.build.fpu=
xiao_pico.build.float-abi=
xiao_pico.build.architecture=cortex-m0plus
xiao_pico.build.board=SEEED_XIAO_RP2040
xiao_pico.build.ldscript=linker_script.ld
xiao_pico.compiler.mbed.arch.define=-DARDUINO_ARCH_RP2040
xiao_pico.compiler.mbed.defines={build.variant.path}/defines.txt
xiao_pico.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
xiao_pico.compiler.mbed.cflags={build.variant.path}/cflags.txt
xiao_pico.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
xiao_pico.compiler.mbed.includes={build.variant.path}/includes.txt
xiao_pico.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
xiao_pico.compiler.mbed="{build.variant.path}/libs/libmbed.a"
xiao_pico.vid.0=0x2886
xiao_pico.pid.0=0x8042
xiao_pico.upload_port.0.vid=0x2886
xiao_pico.upload_port.0.pid=0x8042

xiao_pico.upload.tool=picotool
xiao_pico.upload.tool.default=picotool
xiao_pico.upload.protocol=
xiao_pico.upload.transport=
xiao_pico.upload.use_1200bps_touch=true
xiao_pico.upload.wait_for_upload_port=false
xiao_pico.upload.native_usb=true
xiao_pico.upload.maximum_size=16777216
xiao_pico.upload.maximum_data_size=270336

xiao_pico.bootloader.tool=openocd
xiao_pico.bootloader.tool.default=openocd
xiao_pico.bootloader.config=-f target/rp2040.cfg
xiao_pico.bootloader.programmer=-f interface/cmsis-dap.cfg

##############################################################

xiaonRF52840Sense.name=Seeed XIAO nRF52840 Sense
xiaonRF52840Sense.build.core=arduino
xiaonRF52840Sense.build.crossprefix=arm-none-eabi-
xiaonRF52840Sense.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/

xiaonRF52840Sense.build.variant=SEEED_XIAO_NRF52840_SENSE
xiaonRF52840Sense.build.mcu=cortex-m4
xiaonRF52840Sense.build.extra_flags=
xiaonRF52840Sense.build.architecture=cortex-m4
xiaonRF52840Sense.build.fpu=-mfpu=fpv4-sp-d16
xiaonRF52840Sense.build.float-abi=-mfloat-abi=softfp
xiaonRF52840Sense.build.board=SEEED_XIAO_NRF52840_SENSE
xiaonRF52840Sense.build.ldscript=linker_script.ld
xiaonRF52840Sense.build.sd_name=s140
xiaonRF52840Sense.build.sd_version=7.3.0
xiaonRF52840Sense.build.sd_fwid=0x0123

xiaonRF52840Sense.compiler.mbed.arch.define=-DARDUINO_ARCH_NRF52840
xiaonRF52840Sense.compiler.mbed.defines={build.variant.path}/defines.txt
xiaonRF52840Sense.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
xiaonRF52840Sense.compiler.mbed.cflags={build.variant.path}/cflags.txt
xiaonRF52840Sense.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
xiaonRF52840Sense.compiler.mbed.includes={build.variant.path}/includes.txt
xiaonRF52840Sense.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
xiaonRF52840Sense.compiler.mbed="{build.variant.path}/libs/libmbed.a" "{build.variant.path}/libs/libcc_310_core.a" "{build.variant.path}/libs/libcc_310_ext.a" "{build.variant.path}/libs/libcc_310_trng.a"
xiaonRF52840Sense.vid.0=0x2886
xiaonRF52840Sense.pid.0=0x0045
xiaonRF52840Sense.vid.1=0x2886
xiaonRF52840Sense.pid.1=0x8045
xiaonRF52840Sense.vid.2=0x2886
xiaonRF52840Sense.pid.2=0x0145
xiaonRF52840Sense.upload_port.0.vid=0x2886
xiaonRF52840Sense.upload_port.0.pid=0x0045
xiaonRF52840Sense.upload_port.1.vid=0x2886
xiaonRF52840Sense.upload_port.1.pid=0x8045
xiaonRF52840Sense.upload_port.2.vid=0x2886
xiaonRF52840Sense.upload_port.2.pid=0x0145

xiaonRF52840Sense.bootloader.tool=bootburn
xiaonRF52840Sense.upload.tool=nrfutil
xiaonRF52840Sense.upload.protocol=nrfutil
xiaonRF52840Sense.upload.use_1200bps_touch=true
xiaonRF52840Sense.upload.wait_for_upload_port=true
xiaonRF52840Sense.upload.maximum_size=811008
xiaonRF52840Sense.upload.maximum_data_size=237568

xiaonRF52840Sense.bootloader.tool=openocd
xiaonRF52840Sense.bootloader.tool.default=openocd
xiaonRF52840Sense.bootloader.extra_action.preflash=echo INFO:removed_mass-erase
xiaonRF52840Sense.bootloader.config=-f target/nrf52.cfg
xiaonRF52840Sense.bootloader.programmer=-f interface/cmsis-dap.cfg
xiaonRF52840Sense.bootloader.file=Seeed_XIAO_nRF52840_Sense/Seeed_XIAO_nRF52840_Sense_bootloader-0.6.1_s140_7.3.0.hex